jwy8612/monitor/software/header/_ioCAN32to128v.h
/* Status REGister */
#define SREG	(*(volatile unsigned char *)0x5F)

/* Watchdog Timer Control Register */
#define WDTCR	(*(volatile unsigned char *)0x60)
#define  WDTOE    4
#define  WDCE     4
#define  WDE      3
#define  WDP2     2
#define  WDP1     1
#define  WDP0     0

/* Oscillator */
#define CLKPR	(*(volatile unsigned char *)0x61)
#define  CLKPCE   7
#define  CLKPS3   3
#define  CLKPS2   2
#define  CLKPS1   1
#define  CLKPS0   0
#define OSCCAL	(*(volatile unsigned char *)0x66)

/* External Interrupt configuration */
#define EICRA	(*(volatile unsigned char *)0x69)
#define  ISC31    7
#define  ISC30    6
#define  ISC21    5
#define  ISC20    4
#define  ISC11    3
#define  ISC10    2
#define  ISC01    1
#define  ISC00    0
#define EICRB	(*(volatile unsigned char *)0x6A)
#define  ISC71    7
#define  ISC70    6
#define  ISC61    5
#define  ISC60    4
#define  ISC51    3
#define  ISC50    2
#define  ISC41    1
#define  ISC40    0

/* Timer/Counter Interrupts */
#define TIMSK0	(*(volatile unsigned char *)0x6e)
#define  OCIE0A   1
#define  OCIE0    1
#define  TOIE0    0
#define TIMSK1	(*(volatile unsigned char *)0x6f)
#define  TICIE1   5
#define  ICIE1    5
#define  OCIE1C   3
#define  OCIE1B   2
#define  OCIE1A   1
#define  TOIE1    0
#define TIMSK2	(*(volatile unsigned char *)0x70)
#define  OCIE2A   1
#define  OCIE2    1
#define  TOIE2    0
#define TIMSK3	(*(volatile unsigned char *)0x71)
#define  TICIE3   5
#define  ICIE3    5
#define  OCIE3C   3
#define  OCIE3B   2
#define  OCIE3A   1
#define  TOIE3    0

/* eXternal Memory Control Register */
#define XMCRA	(*(volatile unsigned char *)0x74)
#define  SRE      7
#define  SRL2     6
#define  SRL1     5
#define  SRL0     4
#define  SRW11    3
#define  SRW10    2
#define  SRW01    1
#define  SRW00    0
#define XMCRB	(*(volatile unsigned char *)0x75)
#define  XMBK     7
#define  XMM2     2
#define  XMM1     1
#define  XMM0     0

/* Analog Digital Converter */
#define ADC 	(*(volatile unsigned int *)0x78)
#define ADCL	(*(volatile unsigned char *)0x78)
#define ADCH	(*(volatile unsigned char *)0x79)
#define ADCSRA	(*(volatile unsigned char *)0x7a)
#define  ADEN     7
#define  ADSC     6
#define  ADATE    5
#define  ADFR     5
#define  ADIF     4
#define  ADIE     3
#define  ADPS2    2
#define  ADPS1    1
#define  ADPS0    0
#define ADCSRB	(*(volatile unsigned char *)0x7b)
#define  ADHSM    7
#define  ACME     6
#define  ADTS2    2
#define  ADTS1    1
#define  ADTS0    0
#define ADMUX	(*(volatile unsigned char *)0x7c)
#define  REFS1    7
#define  REFS0    6
#define  ADLAR    5
#define  MUX4     4
#define  MUX3     3
#define  MUX2     2
#define  MUX1     1
#define  MUX0     0
#define DIDR1	(*(volatile unsigned char *)0x7f)
#define  AIN1D    1
#define  AIN0D    0
#define DIDR0	(*(volatile unsigned char *)0x7e)
#define  ADC7D    7
#define  ADC6D    6
#define  ADC5D    5
#define  ADC4D    4
#define  ADC3D    3
#define  ADC2D    2
#define  ADC1D    1
#define  ADC0D    0

/* Timer/Counter 1 */
#define TCCR1A	(*(volatile unsigned char *)0x80)
#define  COM1A1   7
#define  COM1A0   6
#define  COM1B1   5
#define  COM1B0   4
#define  COM1C1   3
#define  COM1C0   2
#define  WGM11    1
#define  WGM10    0
#define TCCR1B	(*(volatile unsigned char *)0x81)
#define  ICNC1    7
#define  ICES1    6
#define  WGM13    4
#define  WGM12    3
#define  CS12     2
#define  CS11     1
#define  CS10     0
#define TCCR1C	(*(volatile unsigned char *)0x82)
#define  FOC1A    7
#define  FOC1B    6
#define  FOC1C    5
#define TCNT1	(*(volatile unsigned int *)0x84)
#define TCNT1L	(*(volatile unsigned char *)0x84)
#define TCNT1H	(*(volatile unsigned char *)0x85)
#define ICR1	(*(volatile unsigned int *)0x86)
#define ICR1L	(*(volatile unsigned char *)0x86)
#define ICR1H	(*(volatile unsigned char *)0x87)
#define OCR1A	(*(volatile unsigned int *)0x88)
#define OCR1AL	(*(volatile unsigned char *)0x88)
#define OCR1AH	(*(volatile unsigned char *)0x89)
#define OCR1B	(*(volatile unsigned int *)0x8a)
#define OCR1BL	(*(volatile unsigned char *)0x8a)
#define OCR1BH	(*(volatile unsigned char *)0x8b)
#define OCR1C	(*(volatile unsigned int *)0x8c)
#define OCR1CL	(*(volatile unsigned char *)0x8c)
#define OCR1CH	(*(volatile unsigned char *)0x8d)

/* Timer/Counter 3 */
#define TCCR3A	(*(volatile unsigned char *)0x90)
#define  COM3A1   7
#define  COM3A0   6
#define  COM3B1   5
#define  COM3B0   4
#define  COM3C1   3
#define  COM3C0   2
#define  WGM31    1
#define  WGM30    0
#define TCCR3B	(*(volatile unsigned char *)0x91)
#define  ICNC3    7
#define  ICES3    6
#define  WGM33    4
#define  WGM32    3
#define  CS32     2
#define  CS31     1
#define  CS30     0
#define TCCR3C	(*(volatile unsigned char *)0x92)
#define  FOC3A    7
#define  FOC3B    6
#define  FOC3C    5
#define TCNT3	(*(volatile unsigned int *)0x94)
#define TCNT3L	(*(volatile unsigned char *)0x94)
#define TCNT3H	(*(volatile unsigned char *)0x95)
#define ICR3	(*(volatile unsigned int *)0x96)
#define ICR3L	(*(volatile unsigned char *)0x96)
#define ICR3H	(*(volatile unsigned char *)0x97)
#define OCR3A	(*(volatile unsigned int *)0x98)
#define OCR3AL	(*(volatile unsigned char *)0x98)
#define OCR3AH	(*(volatile unsigned char *)0x99)
#define OCR3B	(*(volatile unsigned int *)0x9a)
#define OCR3BL	(*(volatile unsigned char *)0x9a)
#define OCR3BH	(*(volatile unsigned char *)0x9b)
#define OCR3C	(*(volatile unsigned int *)0x9c)
#define OCR3CL	(*(volatile unsigned char *)0x9c)
#define OCR3CH	(*(volatile unsigned char *)0x9d)

/* Timer/Counter 2 */
#define TCCR2A	(*(volatile unsigned char *)0xb0)
#define TCCR2	(*(volatile unsigned char *)0xb0)
#define  FOC2     7
#define  FOC2A    7
#define  WGM20    6
#define  COM21    5
#define  COM20    4
#define  COM2A1   5
#define  COM2A0   4
#define  WGM21    3
#define  CS22     2
#define  CS21     1
#define  CS20     0
#define TCNT2	(*(volatile unsigned char *)0xb2)
#define OCR2A	(*(volatile unsigned char *)0xb3)
#define OCR2	(*(volatile unsigned char *)0xb3)
#define ASSR	(*(volatile unsigned char *)0xb6)
#define  EXCLK    4
#define  AS2      3
#define  TCN2UB   2
#define  OCR2UB   1
#define  TCR2UB   0

