jwy8612/monitor/software/header/_ioCAN32to128v.h
/* Two-Wire serial Interface */
#define TWBR	(*(volatile unsigned char *)0xb8)
#define TWSR	(*(volatile unsigned char *)0xb9)
#define  TWS7     7
#define  TWS6     6
#define  TWS5     5
#define  TWS4     4
#define  TWS3     3
#define  TWS      3
#define  TWPS1    1
#define  TWPS0    0
#define TWAR	(*(volatile unsigned char *)0xba)
#define  TWA6     7
#define  TWA5     6
#define  TWA4     5
#define  TWA3     4
#define  TWA2     3
#define  TWA1     2
#define  TWA0     1
#define  TWA      1
#define  TWGCE    0
#define TWDR	(*(volatile unsigned char *)0xbb)
#define TWCR	(*(volatile unsigned char *)0xbc)
#define  TWINT    7
#define  TWEA     6
#define  TWSTA    5
#define  TWSTO    4
#define  TWWC     3
#define  TWEN     2
#define  TWIE     0

/* USART-0 (default USART) */
#define UCSR0A	(*(volatile unsigned char *)0xc0)
#define UCSRA	(*(volatile unsigned char *)0xc0)
#define  RXC0     7
#define  TXC0     6
#define  UDRE0    5
#define  FE0      4
#define  DOR0     3
#define  UPE0     2
#define  U2X0     1
#define  MPCM0    0
#define  RXC      7
#define  TXC      6
#define  UDRE     5
#define  FE       4
#define  DOR      3
#define  OVR      3    /*This definition differs from the databook*/
#define  UPE      2
#define  PE       2
#define  U2X      1
#define  MPCM     0
#define UCSR0B	(*(volatile unsigned char *)0xc1)
#define UCSRB	(*(volatile unsigned char *)0xc1)
#define  RXCIE0   7
#define  TXCIE0   6
#define  UDRIE0   5
#define  RXEN0    4
#define  TXEN0    3
#define  UCSZ02   2
#define  RXB80    1
#define  TXB80    0
#define  RXCIE    7
#define  TXCIE    6
#define  UDRIE    5
#define  RXEN     4
#define  TXEN     3
#define  UCSZ2    2
#define  RXB8     1
#define  TXB8     0
#define UCSR0C	(*(volatile unsigned char *)0xc2)
#define UCSRC	(*(volatile unsigned char *)0xc2)
#define  UMSEL0   6
#define  UPM01    5
#define  UPM00    4
#define  USBS0    3
#define  UCSZ01   2
#define  UCSZ00   1
#define  UCPOL0   0
#define  UMSEL    6
#define  UPM1     5
#define  UPM0     4
#define  USBS     3
#define  UCSZ1    2
#define  UCSZ0    1
#define  UCPOL    0
#define UBRR0 	(*(volatile unsigned int *)0xc4)
#define UBRR	(*(volatile unsigned int *)0xc4)
#define UBRR0L	(*(volatile unsigned char *)0xc4)
#define UBRRL	(*(volatile unsigned char *)0xc4)
#define UBRR0H	(*(volatile unsigned char *)0xc5)
#define UBRRH	(*(volatile unsigned char *)0xc5)
#define UDR0	(*(volatile unsigned char *)0xc6)
#define UDR 	(*(volatile unsigned char *)0xc6)

/* USART-1 */
#define UCSR1A	(*(volatile unsigned char *)0xc8)
#define  RXC1     7
#define  TXC1     6
#define  UDRE1    5
#define  FE1      4
#define  DOR1     3
#define  UPE1     2
#define  U2X1     1
#define  MPCM1    0
#define UCSR1B	(*(volatile unsigned char *)0xc9)
#define  RXCIE1   7
#define  TXCIE1   6
#define  UDRIE1   5
#define  RXEN1    4
#define  TXEN1    3
#define  UCSZ12   2
#define  RXB81    1
#define  TXB81    0
#define UCSR1C	(*(volatile unsigned char *)0xca)
#define  UMSEL1   6
#define  UPM11    5
#define  UPM10    4
#define  USBS1    3
#define  UCSZ11   2
#define  UCSZ10   1
#define  UCPOL1   0
#define UBRR1 	(*(volatile unsigned int *)0xcc)
#define UBRR1L	(*(volatile unsigned char *)0xcc)
#define UBRR1H	(*(volatile unsigned char *)0xcd)
#define UDR1	(*(volatile unsigned char *)0xce)

/* C.A.N */
#define CANGCON (*(volatile unsigned char *)0xd8)
#define  ABRQ     7
#define  OVRQ     6
#define  TTC      5
#define  SYNCTTC  4
#define  LISTEN   3
#define  TEST     2
#define  ENA      1
#define  SWRES    0
#define CANGSTA (*(volatile unsigned char *)0xd9)
#define  OVFG     6
#define  OVRG     6
#define  TXBSY    4
#define  RXBSY    3
#define  ENFG     2
#define  BOFF     1
#define  ERRP     0
#define CANGIT  (*(volatile unsigned char *)0xda)
#define  CANIT    7
#define  BOFFIT   6
#define  OVRTIM   5
#define  OVRBUF   4
#define  BXOK     4
#define  SERG     3
#define  CERG     2
#define  FERG     1
#define  AERG     0
#define  ERR_GEN_MSK 0x0f
#define  INT_GEN_MSK 0x5f
#define CANGIE  (*(volatile unsigned char *)0xdb)
#define  ENIT     7
#define  ENBOFF   6
#define  ENRX     5
#define  ENTX     4
#define  ENERMOB  3
#define  ENERR    3
#define  ENBUF    2
#define  ENBX     2
#define  ENERG    1
#define  ENOVRT   0
#define CANEN2  (*(volatile unsigned char *)0xdc)
#define CANEN1  (*(volatile unsigned char *)0xdd)
#define CANIE2  (*(volatile unsigned char *)0xde)
#define CANIE1  (*(volatile unsigned char *)0xdf)
#define CANSIT2 (*(volatile unsigned char *)0xe0)
#define CANSIT1 (*(volatile unsigned char *)0xe1)
#define CANBT1  (*(volatile unsigned char *)0xe2)
#define  BRP      1
#define  BRP_MSK  0x7e
#define CANBT2  (*(volatile unsigned char *)0xe3)
#define  SJW1     6
#define  SJW0     5
#define  SJW      5
#define  PRS2     3
#define  PRS1     2
#define  PRS0     1
#define  PRS      1
#define  SJW_MSK  0x60
#define  PRS_MSK  0x0e
#define CANBT3  (*(volatile unsigned char *)0xe4)
#define  PHS22    6
#define  PHS21    5
#define  PHS20    4
#define  PHS2     4
#define  PHS12    3
#define  PHS11    2
#define  PHS10    1
#define  PHS1     1
#define  SMP      0
#define  PHS2_MSK 0x70
#define  PHS1_MSK 0x0e
#define CANTCON (*(volatile unsigned char *)0xe5)
#define CANTIM  (*(volatile unsigned int *)0xe6)
#define CANTIML (*(volatile unsigned char *)0xe6)
#define CANTIMH (*(volatile unsigned char *)0xe7)
#define CANTTC  (*(volatile unsigned int *)0xe8)
#define CANTTCL (*(volatile unsigned char *)0xe8)
#define CANTTCH (*(volatile unsigned char *)0xe9)
#define CANTEC  (*(volatile unsigned char *)0xea)
#define CANREC  (*(volatile unsigned char *)0xeb)
#define CANHPMOB (*(volatile unsigned char *)0xec)
#define  HPMOB3   7
#define  HPMOB2   6
#define  HPMOB1   5
#define  HPMOB0   4
#define  HPMOB    4
#define  HPMOB_MSK 0xf0
#define  CGP33    3
#define  CGP32    2
#define  CGP31    1
#define  CGP30    0
#define  CGP      0
#define CANPAGE (*(volatile unsigned char *)0xed)
#define  MOBNB3   7
#define  MOBNB2   6
#define  MOBNB1   5
#define  MOBNB0   4
#define  MOBNB    4
#define  MOBNB_MSK 0xf0
#define  AINC     3
#define  INDX2    2
#define  INDX1    1
#define  INDX0    0
#define  INDX     0
#define  INDX_MSK 0x07
#define CANSTMOB (*(volatile unsigned char *)0xee)
#define  DLCW     7
#define  TXOK     6
#define  RXOK     5
#define  BERR     4
#define  SERR     3
#define  CERR     2
#define  FERR     1
#define  AERR     0
#define  ERR_MOB_MSK 0x1f
#define  INT_MOB_MSK 0x7f
#define CANCDMOB (*(volatile unsigned char *)0xef)
#define  CONMOB1  7
#define  CONMOB0  6
#define  CONMOB   6
#define  RPLV     5
#define  IDE      4
#define  DLC3     3
#define  DLC2     2
#define  DLC1     1
#define  DLC0     0
#define  DLC      0
#define  CONMOB_MSK 0xc0
#define  DLC_MSK    0x0f
#define CANIDT4 (*(volatile unsigned char *)0xf0)
#define  RTRTAG   2
#define  RB1TAG   1
#define  RB0TAG   0
#define CANIDT3 (*(volatile unsigned char *)0xf1)
#define CANIDT2 (*(volatile unsigned char *)0xf2)
#define CANIDT1 (*(volatile unsigned char *)0xf3)
#define CANIDM4 (*(volatile unsigned char *)0xf4)
#define  RTRMSK   2
#define  IDEMSK   0
#define CANIDM3 (*(volatile unsigned char *)0xf5)
#define CANIDM2 (*(volatile unsigned char *)0xf6)
#define CANIDM1 (*(volatile unsigned char *)0xf7)
#define CANSTM  (*(volatile unsigned int *)0xf8)
#define CANSTML (*(volatile unsigned char *)0xf8)
#define CANSTMH (*(volatile unsigned char *)0xf9)
#define CANMSG  (*(volatile unsigned char *)0xfa)

/*--------------------*/
/* Lock and Fuse Bits */
/*--------------------*/

/* lock bits */
#define  BLB12    5
#define  BLB11    4
#define  BLB02    3
#define  BLB01    2
#define  BLB      2
#define  LB2      1
#define  LB1      0
#define  LB       0

/* fuses extended bits */
#define  BODLEVEL2 3
#define  BODLEVEL1 2
#define  BODLEVEL0 1
#define  BODLEVEL  1
#define  TA0SEL    0

