jwy8612/monitor/software/header/_ioCAN32to128v.h
/* fuses high bits */
#define  OCDEN    7
#define  JTAGEN   6
#define  SPIEN    5
#define  WDTON    4
#define  EESAVE   3
#define  BOOTSZ1  2
#define  BOOTSZ0  1
#define  BOOTSZ   1
#define  BOOTRST  0

/* fuses low bits */
#define  CKDIV8   7
#define  CKOUT    6
#define  SUT1     5
#define  SUT0     4
#define  SUT      4
#define  CKSEL3   3
#define  CKSEL2   2
#define  CKSEL1   1
#define  CKSEL0   0
#define  CKSEL    0

/*--------------------------*/
/* Interrupt Vector Numbers */
/*--------------------------*/

#define iv_RESET        1
#define iv_INT0         2
#define iv_EXT_INT0     2
#define iv_INT1         3
#define iv_EXT_INT1     3
#define iv_INT2         4
#define iv_EXT_INT2     4
#define iv_INT3         5
#define iv_EXT_INT3     5
#define iv_INT4         6
#define iv_EXT_INT4     6
#define iv_INT5         7
#define iv_EXT_INT5     7
#define iv_INT6         8
#define iv_EXT_INT6     8
#define iv_INT7         9
#define iv_EXT_INT7     9
#define iv_TIM2_COMP    10
#define iv_TIMER2_COMP  10
#define iv_TIM2_OVF     11
#define iv_TIMER2_OVF   11
#define iv_TIM1_CAPT    12
#define iv_TIMER1_CAPT  12
#define iv_TIM1_COMPA   13
#define iv_TIMER1_COMPA 13
#define iv_TIM1_COMPB   14
#define iv_TIMER1_COMPB 14
#define iv_TIM1_COMPC   15
#define iv_TIMER1_COMPC 15
#define iv_TIM1_OVF     16
#define iv_TIMER1_OVF   16
#define iv_TIM0_COMP    17
#define iv_TIMER0_COMP  17
#define iv_TIM0_OVF     18
#define iv_TIMER0_OVF   18
#define iv_CAN_IT       19
#define iv_CANIT        19
#define iv_CAN          19
#define iv_CAN_TRANSFER 19
#define iv_CTIM_OVF     20
#define iv_OVRIT        20
#define iv_CAN_TIM_OVF  20
#define iv_CAN_TIM_OVR  20
#define iv_SPI_STC      21
#define iv_USART0_RX    22
#define iv_USART0_RXC   22
#define iv_USART0_DRE   23
#define iv_USART0_UDRE  23
#define iv_USART0_TX    24
#define iv_USART0_TXC   24
#define iv_ANA_COMP     25
#define iv_ANALOG_COMP  25
#define iv_ADC          26
#define iv_EE_RDY       27
#define iv_EE_READY     27
#define iv_TIM3_CAPT    28
#define iv_TIMER3_CAPT  28
#define iv_TIM3_COMPA   29
#define iv_TIMER3_COMPA 29
#define iv_TIM3_COMPB   30
#define iv_TIMER3_COMPB 30
#define iv_TIM3_COMPC   31
#define iv_TIMER3_COMPC 31
#define iv_TIM3_OVF     32
#define iv_TIMER3_OVF   32
#define iv_USART1_RX    33
#define iv_USART1_RXC   33
#define iv_USART1_DRE   34
#define iv_USART1_UDRE  34
#define iv_USART1_TX    35
#define iv_USART1_TXC   35
#define iv_TWI          36
#define iv_TWSI         36
#define iv_SPM_RDY      37
#define iv_SPM_READY    37

/* */

#endif

